#!/usr/bin/python
# -*- coding: utf8

"""
Васильев,
    стр. 338, формула (7а)
    стр. 339, формула (8) с точностью до замены 2*eps → eps
"""

__author__ = 'kirienko'

from sympy import symbols, zeta, poly, pi

n, u, e = symbols('n u e')

def z(k):
    return float(zeta(k))


Pi = pi.evalf()
g = u

def gamma(k):
    _gamma = u**2 *(n+2)/36 - u**3 * (n+2)*(n+8)/432 + \
    5*u**4*(n+2)/5184* (-n**2+18*n+100) - \
    u**5*(n+2)/186624 * (39*n**3 + 296*n**2+22752*n+77056 - \
    48* z(3) * (n**3-6*n**2+64*n+184) + 1152*z(4)*(5*n+22))
    gamma_k = poly(_gamma.subs(n,k).expand()).all_coeffs()
    gamma_k.reverse()
    gamma_k = [2*g for g in gamma_k]
    return gamma_k

def uStar(eps):
    return float(eps)/3 + eps**2 * 17./81 + float(eps**3)/27 * (709./648 - 4*z(3)) + \
        float(eps**4)/81 * (10909./11664 -106./9 * z(3) - 6*z(4) + 40*z(5))

def beta(k):
    _beta =  (-2*e)*g+(8./3+1./3*n)*g**2+(-14./3-n)*g**3\
            +(370./27+11./72*n**2+20./9*z(3)*n+88./9*z(3)+461./108*n)*g**4\
            +(-24581./486+176./1215*Pi**4+5./3888*n**3-14./9*z(3)*n**2-395./243*n**2-1528./81*z(3)*n
              -4664./81*z(3)-2200./81*n*z(5)+62./1215*Pi**4*n-10057./486*n-80./81*n**2*z(5)
              -2480./27*z(5)+1./243*Pi**4*n**2)*g**5\
            +(17158./81-88./81*Pi**4+26./81*z(3)*n**3+6289./31104*n**3+8455./486*z(3)*n**2
              +343*n*z(7)-1240./5103*Pi**6+50531./3888*n**2+69035./486*z(3)*n+27382./81*z(3)
              +66986./243*n*z(5)-2383./4860*Pi**4*n+103849./972*n-5./15309*Pi**6*n**3+1088./27*z(3)**2
              +7466./243*n**2*z(5)+25774./27*z(7)+55028./81*z(5)+446./81*z(3)**2*n-355./30618*Pi**6*n**2
              +686./27*n**2*z(7)+305./243*n**3*z(5)-59./81*z(3)**2*n**2-1565./15309*Pi**6*n-7./2160*Pi**4*n**3
              -2./27*z(3)**2*n**3+13./62208*n**4-1./432*z(3)*n**4-347./4860*Pi**4*n**2)*g**6
    _beta_k = poly(_beta.subs(e,1).subs(n,k).expand()).all_coeffs()
    _beta_k.reverse()
    return _beta_k


if __name__ == "__main__":

    print "gamma = ",gamma(1)
    print "u* =", uStar(1)
    print "beta =", beta(1)